BASICS

In [359]:
import pandas as pd
import numpy as np
ser=pd.Series([10,20,30,40,50])
# ser.dtype
# ser.values
print(ser)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [361]:
ser.values
ser.dtype # HERE DATE TYPE IS IN OBJECT SO IN O/P IT REPRESENTS AS 'O'. IF IT IS INT MEANS 'int64'

dtype('int64')

In [363]:
ser.index

RangeIndex(start=0, stop=5, step=1)

In [365]:
print(ser.name) # IF SER.NAME MEANS IT WILL NOT RETURN ANYTHING NO O/P. IF WE USE PRINT STATEMENTS THEN ONLY IT WILL PRINT

None

In [367]:
ser.name="Prices"
print(ser)

0    10
1    20
2    30
3    40
4    50
Name: Prices, dtype: int64

 INDEXING

In [370]:
ser[0:3]

0    10
1    20
2    30
Name: Prices, dtype: int64

In [372]:
print(ser.iloc[3]) # iloc--> IS LOCATION BASED INDEXING SINGLE VALUE ACCESSING
print()
print(ser.iloc[[1,3,4]]) # MUTLIPLE USING INDEX

40

1    20
3    40
4    50
Name: Prices, dtype: int64

In [374]:
index=["banana", "orange", "blueberry", "jack", "berry"]
ser.index=index # HERE WE ARE ASSINGING TO THAT "ser" INDEX TO OUR GIVEN INDEX SO IT CHANGES
print(ser)
print(ser.index)

banana       10
orange       20
blueberry    30
jack         40
berry        50
Name: Prices, dtype: int64
Index(['banana', 'orange', 'blueberry', 'jack', 'berry'], dtype='object')

In [376]:
ser.iloc[2]

30

In [378]:
# loc --> LABEL BASED INDEXING.
ser.loc[["orange","banana"]]

orange    20
banana    10
Name: Prices, dtype: int64

In [380]:

# IN LABEL BASED INDEXING YOUR START AS WELL AS STOP VALUE BOTH ARE INCLUDED IN THE O/P.
ser ['banana':'blueberry']

banana       10
orange       20
blueberry    30
Name: Prices, dtype: int64

CREATING SERIES USING DICT...

In [383]:
fruit_price={
    "banana":30,
    "grape":20,
    "orange":30,
    "apple":40,
    "jack":50,
    "berry":10
}

In [385]:
ser1=pd.Series(fruit_price)
ser1.name="Fruits"
print(ser1)

banana    30
grape     20
orange    30
apple     40
jack      50
berry     10
Name: Fruits, dtype: int64

CONDITIONAL SELECTION

In [388]:
# HERE I'M GOING TO SELECT THE FRUITS GREATER THAN OR EQUAL 30 RS. PRICE
ser1[ser1>=30] #--> IT IS USED TO PRINT THAT PARTICULAR VALUE OR KEY

# print(ser1>=30)

banana    30
orange    30
apple     40
jack      50
Name: Fruits, dtype: int64

LOGICAL OPERATORS--> AND, OR, NOT

In [391]:
[(ser1>=10) & (ser1<40)] #--> AND OPERATION

[banana     True
 grape      True
 orange     True
 apple     False
 jack      False
 berry      True
 Name: Fruits, dtype: bool]

In [393]:
[(ser1<=20) | (ser1>=40)] # OR operator

[banana    False
 grape      True
 orange    False
 apple      True
 jack       True
 berry      True
 Name: Fruits, dtype: bool]

In [395]:
ser1[~(ser1>30)] #NOT operator

banana    30
grape     20
orange    30
berry     10
Name: Fruits, dtype: int64

In [397]:
# MODIFYING DATA
ser1["jack"]=40         # as like list concept
print(ser1)

banana    30
grape     20
orange    30
apple     40
jack      40
berry     10
Name: Fruits, dtype: int64

DATA FRAME

In [955]:
data={
    "Names":["logesh","nandhakishore","jothis","balaji","sairam","ezhil","prakash","sairam"],
    "Age":[21,25,np.nan,2,37,10,30,37],
    "Department":["EEE","IT","ECE","MECH","CIVIL","CSE","AIML","CIVIL"],
    "Salary":[50,60,45,70,68,np.nan,55,68]
}
print(data)

{'Names': ['logesh', 'nandhakishore', 'jothis', 'balaji', 'sairam', 'ezhil', 'prakash', 'sairam'], 'Age': [21, 25, nan, 2, 37, 10, 30, 37], 'Department': ['EEE', 'IT', 'ECE', 'MECH', 'CIVIL', 'CSE', 'AIML', 'CIVIL'], 'Salary': [50, 60, 45, 70, 68, nan, 55, 68]}

In [957]:
res=pd.DataFrame(data)
print(res)
# print(res)

           Names   Age Department  Salary
0         logesh  21.0        EEE    50.0
1  nandhakishore  25.0         IT    60.0
2         jothis   NaN        ECE    45.0
3         balaji   2.0       MECH    70.0
4         sairam  37.0      CIVIL    68.0
5          ezhil  10.0        CSE     NaN
6        prakash  30.0       AIML    55.0
7         sairam  37.0      CIVIL    68.0

In [959]:
res.head(2)

           Names   Age Department  Salary
0         logesh  21.0        EEE    50.0
1  nandhakishore  25.0         IT    60.0

In [961]:
res.tail(2)

     Names   Age Department  Salary
6  prakash  30.0       AIML    55.0
7   sairam  37.0      CIVIL    68.0

In [963]:
res.iloc[1:3,:2] # THIS IS SLICING
# IN THE ABOVE ONE :2 MEANS BEFORE COLON ADD ALL KEY:VALUE PAIR BEFORE THE 2 SO THE O/P LOOKS LIKE BELOW ONE

           Names   Age
1  nandhakishore  25.0
2         jothis   NaN

In [965]:
res.loc[1:3,["Age","Salary"]] # THIS IS PICKING BASED ON OUR REQUIREMENT
# WE NEED TO SELECT ROW AND COLUMN FOR THAT NEED TO  USE ":"  COLON
# COLUMN ARE KNOW AS FEATURES

    Age  Salary
1  25.0    60.0
2   NaN    45.0
3   2.0    70.0

In [967]:
res.loc[1:3,["Names","Department"]] # THIS IS PICKING BASED ON OUR REQUIREMENT

           Names Department
1  nandhakishore         IT
2         jothis        ECE
3         balaji       MECH

In [969]:
res.drop("Department", axis=1) # THIS "drop" IS USED TO DELETE THE ENTIRE COLUMN BUT IT WON'T AFFECT THE ORIGINAL DATA

           Names   Age  Salary
0         logesh  21.0    50.0
1  nandhakishore  25.0    60.0
2         jothis   NaN    45.0
3         balaji   2.0    70.0
4         sairam  37.0    68.0
5          ezhil  10.0     NaN
6        prakash  30.0    55.0
7         sairam  37.0    68.0

In [971]:
# res.drop("Department", axis=1, inplace=True) # THIS "inplace" METHOD IS USED TO DELECTE THE ENTIRE COLUMN IN ORIGINAL DATASET ITSELF

In [973]:
print(res)
print("This gives the row and columns present in dataset: ",res.shape)

           Names   Age Department  Salary
0         logesh  21.0        EEE    50.0
1  nandhakishore  25.0         IT    60.0
2         jothis   NaN        ECE    45.0
3         balaji   2.0       MECH    70.0
4         sairam  37.0      CIVIL    68.0
5          ezhil  10.0        CSE     NaN
6        prakash  30.0       AIML    55.0
7         sairam  37.0      CIVIL    68.0
This gives the row and columns present in dataset:  (8, 4)

In [975]:
res.info() # THIS WILL GIVE ENITRE DATASET VAULES WHICH WE USED

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Names       8 non-null      object
 1   Age         7 non-null      float64
 2   Department  8 non-null      object
 3   Salary      7 non-null      float64
dtypes: float64(2), object(2)
memory usage: 388.0+ bytes

In [977]:
res.describe() # THIS ONE IS USED TO GIVE INFO ABOUT OUR DATASET
# TOTAL IS --> 7, MEAN VALUE IS: 20, STANDARD DEVIATION IS 12 AND SO ON..

             Age     Salary
count   7.000000   7.000000
mean   23.142857  59.428571
std    13.284434   9.795529
min     2.000000  45.000000
25%    15.500000  52.500000
50%    25.000000  60.000000
75%    33.500000  68.000000
max    37.000000  70.000000

In [979]:
# WHERE I NEED TO INCREASE THE SALARY OF EVERYONE BY 50 
res["Salary"]=res["Salary"]+50
print(res,"\n")
print(res["Salary"])
print("\n",res.describe())

           Names   Age Department  Salary
0         logesh  21.0        EEE   100.0
1  nandhakishore  25.0         IT   110.0
2         jothis   NaN        ECE    95.0
3         balaji   2.0       MECH   120.0
4         sairam  37.0      CIVIL   118.0
5          ezhil  10.0        CSE     NaN
6        prakash  30.0       AIML   105.0
7         sairam  37.0      CIVIL   118.0

0    100.0
1    110.0
2     95.0
3    120.0
4    118.0
5      NaN
6    105.0
7    118.0
Name: Salary, dtype: float64

              Age      Salary
count   7.000000    7.000000
mean   23.142857  109.428571
std    13.284434    9.795529
min     2.000000   95.000000
25%    15.500000  102.500000
50%    25.000000  110.000000
75%    33.500000  118.000000
max    37.000000  120.000000

In [981]:
# RENAMING COLUMN as like in dictionary but here we need to mention which one column or row here we rename column
res.rename(columns={"Department":"Dept"},inplace=True) 
print(res)

           Names   Age   Dept  Salary
0         logesh  21.0    EEE   100.0
1  nandhakishore  25.0     IT   110.0
2         jothis   NaN    ECE    95.0
3         balaji   2.0   MECH   120.0
4         sairam  37.0  CIVIL   118.0
5          ezhil  10.0    CSE     NaN
6        prakash  30.0   AIML   105.0
7         sairam  37.0  CIVIL   118.0

In [983]:
print("The unique dept ine company: ",res["Dept"].unique())
print("The unique salary offered: ",res["Salary"].unique())

The unique dept ine company:  ['EEE' 'IT' 'ECE' 'MECH' 'CIVIL' 'CSE' 'AIML']
The unique salary offered:  [100. 110.  95. 120. 118.  nan 105.]

In [985]:
res["Dept"].value_counts()

Dept
CIVIL    2
EEE      1
IT       1
ECE      1
MECH     1
CSE      1
AIML     1
Name: count, dtype: int64

In [987]:
res["Promoted salary"]=res["Salary"]*10
res.rename(columns={"Promoted salary": "Promot"},inplace=True)
print(res)

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0  1000.0
1  nandhakishore  25.0     IT   110.0  1100.0
2         jothis   NaN    ECE    95.0   950.0
3         balaji   2.0   MECH   120.0  1200.0
4         sairam  37.0  CIVIL   118.0  1180.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0  1050.0
7         sairam  37.0  CIVIL   118.0  1180.0

In [989]:
# DATA CLEANING
res.isnull().sum()

Names     0
Age       1
Dept      0
Salary    1
Promot    1
dtype: int64

In [991]:
res.dropna(how="any") # any row that had any null value

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0  1000.0
1  nandhakishore  25.0     IT   110.0  1100.0
3         balaji   2.0   MECH   120.0  1200.0
4         sairam  37.0  CIVIL   118.0  1180.0
6        prakash  30.0   AIML   105.0  1050.0
7         sairam  37.0  CIVIL   118.0  1180.0

In [993]:
res.dropna(how="all") #display all values using "all"

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0  1000.0
1  nandhakishore  25.0     IT   110.0  1100.0
2         jothis   NaN    ECE    95.0   950.0
3         balaji   2.0   MECH   120.0  1200.0
4         sairam  37.0  CIVIL   118.0  1180.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0  1050.0
7         sairam  37.0  CIVIL   118.0  1180.0

In [995]:
res["Age"].fillna(res["Age"].mean())

0    21.000000
1    25.000000
2    23.142857
3     2.000000
4    37.000000
5    10.000000
6    30.000000
7    37.000000
Name: Age, dtype: float64

In [997]:
res["Salary"].fillna(res["Salary"].median())

0    100.0
1    110.0
2     95.0
3    120.0
4    118.0
5    110.0
6    105.0
7    118.0
Name: Salary, dtype: float64

In [999]:
res["Age"].fillna(res["Age"].bfill())

0    21.0
1    25.0
2     2.0
3     2.0
4    37.0
5    10.0
6    30.0
7    37.0
Name: Age, dtype: float64

In [1001]:
res["Names"] = res["Names"].replace("balaji","Podi")
print(res)

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0  1000.0
1  nandhakishore  25.0     IT   110.0  1100.0
2         jothis   NaN    ECE    95.0   950.0
3           Podi   2.0   MECH   120.0  1200.0
4         sairam  37.0  CIVIL   118.0  1180.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0  1050.0
7         sairam  37.0  CIVIL   118.0  1180.0

REMOVING DUPLICATES

In [1004]:
res_dup=res[res.duplicated()]
res_dup

    Names   Age   Dept  Salary  Promot
7  sairam  37.0  CIVIL   118.0  1180.0

In [1006]:
res_dup=res[res.duplicated(keep="last")]
res_dup

    Names   Age   Dept  Salary  Promot
4  sairam  37.0  CIVIL   118.0  1180.0

In [1008]:
res

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0  1000.0
1  nandhakishore  25.0     IT   110.0  1100.0
2         jothis   NaN    ECE    95.0   950.0
3           Podi   2.0   MECH   120.0  1200.0
4         sairam  37.0  CIVIL   118.0  1180.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0  1050.0
7         sairam  37.0  CIVIL   118.0  1180.0

In [1010]:
res=res.drop_duplicates()
print(res)

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0  1000.0
1  nandhakishore  25.0     IT   110.0  1100.0
2         jothis   NaN    ECE    95.0   950.0
3           Podi   2.0   MECH   120.0  1200.0
4         sairam  37.0  CIVIL   118.0  1180.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0  1050.0

INVALID VALUES

In [1013]:
# LAMBDA -->PYTHON
res["Promot"]=res["Promot"].apply(lambda x: x/10 if x>50 else x)
print(res)

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0   100.0
1  nandhakishore  25.0     IT   110.0   110.0
2         jothis   NaN    ECE    95.0    95.0
3           Podi   2.0   MECH   120.0   120.0
4         sairam  37.0  CIVIL   118.0   118.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0   105.0

C:\Users\kongu\AppData\Local\Temp\ipykernel_20380\2438464164.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  res["Promot"]=res["Promot"].apply(lambda x: x/10 if x>50 else x)

In [ ]:
res[["first_name","last_name"]]=res["Names"]

In [1017]:
def multiple(x):
    return x*2
# res["Age"]=res["Age"].apply(lambda x: x*2)
res["Age"]=res["Age"].apply(multiple)
print(res)

           Names   Age   Dept  Salary  Promot
0         logesh  42.0    EEE   100.0   100.0
1  nandhakishore  50.0     IT   110.0   110.0
2         jothis   NaN    ECE    95.0    95.0
3           Podi   4.0   MECH   120.0   120.0
4         sairam  74.0  CIVIL   118.0   118.0
5          ezhil  20.0    CSE     NaN     NaN
6        prakash  60.0   AIML   105.0   105.0

C:\Users\kongu\AppData\Local\Temp\ipykernel_20380\3558439111.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  res["Age"]=res["Age"].apply(multiple)

In [1020]:
res["Age"]=res["Age"].apply(lambda x:x/2)
print(res)

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0   100.0
1  nandhakishore  25.0     IT   110.0   110.0
2         jothis   NaN    ECE    95.0    95.0
3           Podi   2.0   MECH   120.0   120.0
4         sairam  37.0  CIVIL   118.0   118.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0   105.0

C:\Users\kongu\AppData\Local\Temp\ipykernel_20380\1071242295.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  res["Age"]=res["Age"].apply(lambda x:x/2)

In [1022]:
res

           Names   Age   Dept  Salary  Promot
0         logesh  21.0    EEE   100.0   100.0
1  nandhakishore  25.0     IT   110.0   110.0
2         jothis   NaN    ECE    95.0    95.0
3           Podi   2.0   MECH   120.0   120.0
4         sairam  37.0  CIVIL   118.0   118.0
5          ezhil  10.0    CSE     NaN     NaN
6        prakash  30.0   AIML   105.0   105.0

In [1024]:
dept = {
    'Name': ['Arun', 'Bhavna', 'Chetan', 'Diya', 'Elan', 'Farah'],
    'City': ['Chennai', 'Mumbai', 'Chennai', 'Delhi', 'Mumbai', 'Delhi'],
    'Age': [24, 27, 22, 32, 29, 35],
    'Score': [88.5, 91.2, 88.9, 95.0, 85.8, 92.3],
    'JoinDate': ['2023-01-15', '2022-11-20', '2023-01-25', '2021-05-10', '2022-11-22', '2021-04-18']
}
fin=pd.DataFrame(dept)
print(fin)

     Name     City  Age  Score    JoinDate
0    Arun  Chennai   24   88.5  2023-01-15
1  Bhavna   Mumbai   27   91.2  2022-11-20
2  Chetan  Chennai   22   88.9  2023-01-25
3    Diya    Delhi   32   95.0  2021-05-10
4    Elan   Mumbai   29   85.8  2022-11-22
5   Farah    Delhi   35   92.3  2021-04-18

In [1026]:
pd.concat([res,fin])

,Names,Age,Dept,Salary,Promot,Name,City,Score,JoinDate
0,logesh,21.0,EEE,100.0,100.0,NaN,NaN,NaN,NaN
1,nandhakishore,25.0,IT,110.0,110.0,NaN,NaN,NaN,NaN
2,jothis,NaN,ECE,95.0,95.0,NaN,NaN,NaN,NaN
3,Podi,2.0,MECH,120.0,120.0,NaN,NaN,NaN,NaN
4,sairam,37.0,CIVIL,118.0,118.0,NaN,NaN,NaN,NaN
5,ezhil,10.0,CSE,NaN,NaN,NaN,NaN,NaN,NaN
6,prakash,30.0,AIML,105.0,105.0,NaN,NaN,NaN,NaN
0,NaN,24.0,NaN,NaN,NaN,Arun,Chennai,88.5,2023-01-15
1,NaN,27.0,NaN,NaN,NaN,Bhavna,Mumbai,91.2,2022-11-20
2,NaN,22.0,NaN,NaN,NaN,Chetan,Chennai,88.9,2023-01-25
3,NaN,32.0,NaN,NaN,NaN,Diya,Delhi,95.0,2021-05-10
4,NaN,29.0,NaN,NaN,NaN,Elan,Mumbai,85.8,2022-11-22
5,NaN,35.0,NaN,NaN,NaN,Farah,Delhi,92.3,2021-04-18

In [1028]:
pd.concat([res,fin], axis=1)

,Names,Age,Dept,Salary,Promot,Name,City,Age,Score,JoinDate
0,logesh,21.0,EEE,100.0,100.0,Arun,Chennai,24.0,88.5,2023-01-15
1,nandhakishore,25.0,IT,110.0,110.0,Bhavna,Mumbai,27.0,91.2,2022-11-20
2,jothis,NaN,ECE,95.0,95.0,Chetan,Chennai,22.0,88.9,2023-01-25
3,Podi,2.0,MECH,120.0,120.0,Diya,Delhi,32.0,95.0,2021-05-10
4,sairam,37.0,CIVIL,118.0,118.0,Elan,Mumbai,29.0,85.8,2022-11-22
5,ezhil,10.0,CSE,NaN,NaN,Farah,Delhi,35.0,92.3,2021-04-18
6,prakash,30.0,AIML,105.0,105.0,NaN,NaN,NaN,NaN,NaN

In [1067]:
dataa=pd.read_excel("D:/College/EEE_DATABASE.xlsx")
dataa.head(2)

,S.NO,Regno,Student Name,Father name,Department,Aadhar number,PAN NUMBER,Primary mail id,Secondary Mail id,Student Phone Number,...,10th year of passing,12th School Name,12th year of passing,Diploma \n%,Diploma College Name,Address(Full Address),Native Place,12th Cut off,District,Resume Link(public)
0,1,922522105001,Abishree T,Thirumoorthi N,EEE,2884 5322 6998,CHEPT4874L,abithiru2005@gmail.com,abishreethiru@gmail.com,8903742115,...,2020,"Bala Matriculation Higher Secondary School, Ve...",2022,NaN,NaN,"633/A1A, kadaieashwarar thottam, Kadaiyuran va...","Kadaiyuran valasu, Vellakoil",159.5,Tiruppur,https://drive.google.com/drive/folders/1w0ZTwQ...
1,2,922522105002,Balaji.S,Sakthivel.C,EEE,944779651367,TJEPS3292C,balajipmb6@gmail.com,balajisakthiveleee2@gmail.com,6374722455,...,2020,Kalaikovil vidhya mandhir matric higher sconda...,2022,NaN,NaN,"85,Appiyampatti,T.G valasu(po),Oddanchatram(Tk...",Appiyampatti,119.5,Dindigul,https://drive.google.com/drive/folders/1yvBdia...

In [1053]:
dataa.shape

(63, 12)